//Задание 1. Вариант 19. Работа выполнена:  Рябинин Михаил, РИС-26-3Б

#include <iostream> //Подключаем библиотеку для управлением ввода/вывода
using namespace std; //используем пространство имён std

//расчёт формулы для float
float Ff (float a, float b)
{
    float sum = a + b; // для удобства создаём сумму b и a
    return ( sum*sum*sum - a*a*a ) / ( 3*a*b*b + b*b*b + 3*a*a*b ); //возвращаем результат
}

//расчёт формулы для doble:
double Fd (double a, double b)
{
    double sum = a + b; // для удобства создаём сумму b и a
    return ( sum*sum*sum - a*a*a ) / ( 3*a*b*b + b*b*b + 3*a*a*b ); //возвращаем результат
}

int main()
{
    float af = 100 , bf = 0.001; //задаём переменные float
    double ad = 100 , bd = 0.001; //задаём те же переменные double
    cout << "Float type result: " << Ff( af , bf ) << endl; //выводим значение формулы для float
    cout << "Double type result: " << Fd( ad , bd ) << endl; //выводим значение формулы для double
    return 0; //возвращается 0, как индефикатор правильного выполнения программы
}
/* Объяснения результатов раболоторной работы:
Числа float и double хранятся в двоичном формате.
У них имеется фиксированное количество бит для мантиссы и показателя степени.
В следствие чего десятичные дроби не возможно представить в двоичном виде. 
Пример:
double d = 0.1; // в компьютере - 0.100000000000000001
float d2 = 0.1; // в компьютере - 0.100000001
Десятичные значение 0.1 не имеет конечного представления в двоичной системе счисления, что приводит к бесконечной дробной части.
Следовательно, точность его хранения напрямую зависит от разрядности типа данных: для 4-байтового float и 8-байтового double она будет отличаться.
*/