//Задание 2. Вариант 19. Работа выполнена - Рябинин Михаил, РИС-26-3Б

#include <iostream> //Подключаем библиотеку для управлением ввода/вывода
using namespace std; //используем пространство имён std
#include <clocale> //Подключаем библиотеку для локализации

int main(){
    setlocale(LC_ALL, ".65001"); //подключаем русскую локализацию
    int n,m; //объявляем переменные
    cout << "Введите чила m и n: "; //выводим текст
    cin >> n >> m; //вводим числа

    cout << endl << "1) " << (- -m-++n) << endl; 
    

    cout << "2) " << (m * n < n++) << endl;
    

    cout << "3) " << (n-- > m++) << endl; 
    

    return 0; //возвращается 0, как индефикатор правильного выполнения программы
}
/* Вывод: Если оператор стоит после переменной x++ , то для расчетов берется старое число , а переменная увеличивается уже после.
Если оператор стоит перед переменной ++x , то число увеличивается , и только потом идет в расчет. */